## Introduction to Databases

### SQLite exercises

!pip install tabulate

In [34]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd
import tabulate as tabulate



import sqlite3

![Db Schema](../Figs/database-model.gif)

### Establishing a connection

In [35]:
conn = sqlite3.connect(os.path.join("..","SampleDBs",'hr.sqlite'))
cur = conn.cursor()

In [36]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('countries',), ('regions',), ('locations',), ('departments',), ('jobs',), ('employees',), ('department',), ('job_history',), ('prod_mast',), ('prod_backup',), ('orders',), ('tb1',), ('ESERCICIO1',), ('users',), ('tags',), ('s',), ('r',), ('Emor',), ('MIN_SALARY',), ('employee_data',), ('STUDENT',), ('EMPLOYEE_INCOME',), ('details',)]

In [37]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(tabulate.tabulate(cur.fetchall()))

---------------
countries
regions
locations
departments
jobs
employees
department
job_history
prod_mast
prod_backup
orders
tb1
ESERCICIO1
users
tags
s
r
Emor
MIN_SALARY
employee_data
STUDENT
EMPLOYEE_INCOME
details
---------------

In [38]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
for res in cur.fetchall():
    print(res)

('countries',)
('regions',)
('locations',)
('departments',)
('jobs',)
('employees',)
('department',)
('job_history',)
('prod_mast',)
('prod_backup',)
('orders',)
('tb1',)
('ESERCICIO1',)
('users',)
('tags',)
('s',)
('r',)
('Emor',)
('MIN_SALARY',)
('employee_data',)
('STUDENT',)
('EMPLOYEE_INCOME',)
('details',)

In [39]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df.head(10)

          name
0    countries
1      regions
2    locations
3  departments
4         jobs
5    employees
6   department
7  job_history
8    prod_mast
9  prod_backup

### SQL Questions

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

In [40]:
cur.execute("SELECT first_name AS 'First Name' ,  last_name AS 'Last Name'  FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------
Steven       King
Neena        Kochhar
Lex          De Haan
Alexander    Hunold
Bruce        Ernst
David        Austin
Valli        Pataballa
Diana        Lorentz
Nancy        Greenberg
Daniel       Faviet
John         Chen
Ismael       Sciarra
Jose Manuel  Urman
Luis         Popp
Den          Raphaely
Alexander    Khoo
Shelli       Baida
Sigal        Tobias
Guy          Himuro
Karen        Colmenares
Matthew      Weiss
Adam         Fripp
Payam        Kaufling
Shanta       Vollman
Kevin        Mourgos
Julia        Nayer
Irene        Mikkilineni
James        Landry
Steven       Markle
Laura        Bissot
Mozhe        Atkinson
James        Marlow
TJ           Olson
Jason        Mallin
Michael      Rogers
Ki           Gee
Hazel        Philtanker
Renske       Ladwig
Stephen      Stiles
John         Seo
Joshua       Patel
Trenna       Rajs
Curtis       Davies
Randall      Matos
Peter        Vargas
John         Russell
Karen        Partners
Alberto      Errazuriz
Gerald       Cambrault
Eleni        Zlotkey
Peter        Tucker
David        Bernstein
Peter        Hall
Christopher  Olsen
Nanette      Cambrault
Oliver       Tuvault
Janette      King
Patrick      Sully
Allan        McEwen
Lindsey      Smith
Louise       Doran
Sarath       Sewall
Clara        Vishney
Danielle     Greene
Mattea       Marvins
David        Lee
Sundar       Ande
Amit         Banda
Lisa         Ozer
Harrison     Bloom
Tayler       Fox
William      Smith
Elizabeth    Bates
Sundita      Kumar
Ellen        Abel
Alyssa       Hutton
Jonathon     Taylor
Jack         Livingston
Kimberely    Grant
Charles      Johnson
Winston      Taylor
Jean         Fleaur
Martha       Sullivan
Girard       Geoni
Nandita      Sarchand
Alexis       Bull
Julia        Dellinger
Anthony      Cabrio
Kelly        Chung
Jennifer     Dilly
Timothy      Gates
Randall      Perkins
Sarah        Bell
Britney      Everett
Samuel       McCain
Vance        Jones
Alana        Walsh
Kevin        Feeney
Donald       OConnell
Douglas      Grant
Jennifer     Whalen
Michael      Hartstein
Pat          Fay
Susan        Mavris
Hermann      Baer
Shelley      Higgins
William      Gietz
-----------  -----------

+ Write a query to get unique department ID on the table "employees"

In [41]:
cur.execute("SELECT DISTINCT department_id FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

---
 90
 60
100
 30
 50
 80
  0
 10
 20
 40
 70
110
---

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

In [42]:
cur.execute("SELECT * FROM employees ORDER BY first_name DESC;")
print(tabulate.tabulate(cur.fetchall()))

---  -----------  -----------  --------  ------------------  ----------  ----------  -----  ----  ---  ---
180  Winston      Taylor       WTAYLOR   650.507.9876        1987-09-05  SH_CLERK     3200  0     120   50
171  William      Smith        WSMITH    011.44.1343.629268  1987-08-27  SA_REP       7400  0.15  148   80
206  William      Gietz        WGIETZ    515.123.8181        1987-10-01  AC_ACCOUNT   8300  1     205  110
195  Vance        Jones        VJONES    650.501.4876        1987-09-20  SH_CLERK     2800  0     123   50
106  Valli        Pataballa    VPATABAL  590.423.4560        1987-06-23  IT_PROG      4800  0     103   60
141  Trenna       Rajs         TRAJS     650.121.8009        1987-07-28  ST_CLERK     3500  0     124   50
190  Timothy      Gates        TGATES    650.505.3876        1987-09-15  SH_CLERK     2900  0     122   50
170  Tayler       Fox          TFOX      011.44.1343.729268  1987-08-26  SA_REP       9600  0.2   148   80
132  TJ           Olson        TJOLSON   650.124.8234        1987-07-19  ST_CLERK     2100  0     121   50
203  Susan        Mavris       SMAVRIS   515.123.7777        1987-09-28  HR_REP       6500  0     101   40
173  Sundita      Kumar        SKUMAR    011.44.1343.329268  1987-08-29  SA_REP       6100  0.1   148   80
166  Sundar       Ande         SANDE     011.44.1346.629268  1987-08-22  SA_REP       6400  0.1   147   80
100  Steven       King         SKING     515.123.4567        1987-06-17  AD_PRES     24000  0       0   90
128  Steven       Markle       SMARKLE   650.124.1434        1987-07-15  ST_CLERK     2200  0     120   50
138  Stephen      Stiles       SSTILES   650.121.2034        1987-07-25  ST_CLERK     3200  0     123   50
117  Sigal        Tobias       STOBIAS   515.127.4564        1987-07-04  PU_CLERK     2800  0     114   30
116  Shelli       Baida        SBAIDA    515.127.4563        1987-07-03  PU_CLERK     2900  0     114   30
205  Shelley      Higgins      SHIGGINS  515.123.8080        1987-09-30  AC_MGR      12000  1     101  110
123  Shanta       Vollman      SVOLLMAN  650.123.4234        1987-07-10  ST_MAN       6500  0     100   50
161  Sarath       Sewall       SSEWALL   011.44.1345.529268  1987-08-17  SA_REP       7000  0.25  146   80
192  Sarah        Bell         SBELL     650.501.1876        1987-09-17  SH_CLERK     4000  0     123   50
194  Samuel       McCain       SMCCAIN   650.501.3876        1987-09-19  SH_CLERK     3200  0     123   50
137  Renske       Ladwig       RLADWIG   650.121.1234        1987-07-24  ST_CLERK     3600  0     123   50
143  Randall      Matos        RMATOS    650.121.2874        1987-07-30  ST_CLERK     2600  0     124   50
191  Randall      Perkins      RPERKINS  650.505.4876        1987-09-16  SH_CLERK     2500  0     122   50
144  Peter        Vargas       PVARGAS   650.121.2004        1987-07-31  ST_CLERK     2500  0     124   50
150  Peter        Tucker       PTUCKER   011.44.1344.129268  1987-08-06  SA_REP      10000  0.3   145   80
152  Peter        Hall         PHALL     011.44.1344.478968  1987-08-08  SA_REP       9000  0.25  145   80
122  Payam        Kaufling     PKAUFLIN  650.123.3234        1987-07-09  ST_MAN       7900  0     100   50
157  Patrick      Sully        PSULLY    011.44.1345.929268  1987-08-13  SA_REP       9500  0.35  146   80
202  Pat          Fay          PFAY      603.123.6666        1987-09-27  MK_REP       6000  0     201   20
155  Oliver       Tuvault      OTUVAULT  011.44.1344.486508  1987-08-11  SA_REP       7000  0.15  145   80
101  Neena        Kochhar      NKOCHHAR  515.123.4568        1987-06-18  AD_VP       17000  0     100   90
154  Nanette      Cambrault    NCAMBRAU  011.44.1344.987668  1987-08-10  SA_REP       7500  0.2   145   80
184  Nandita      Sarchand     NSARCHAN  650.509.1876        1987-09-09  SH_CLERK     4200  0     121   50
108  Nancy        Greenberg    NGREENBE  515.124.4569        1987-06-25  FI_MGR      12000  0     101  100
130  Mozhe        Atkinson     MATKINSO  650.124.6234        1987-07-17  ST_CLERK     2800  0     121   50
134  Michael      Rogers       MROGERS   650.127.1834        1987-07-21  ST_CLERK     2900  0     122   50
201  Michael      Hartstein    MHARTSTE  515.123.5555        1987-09-26  MK_MAN      13000  0     100   20
120  Matthew      Weiss        MWEISS    650.123.1234        1987-07-07  ST_MAN       8000  0     100   50
164  Mattea       Marvins      MMARVINS  011.44.1346.329268  1987-08-20  SA_REP       7200  0.1   147   80
182  Martha       Sullivan     MSULLIVA  650.507.9878        1987-09-07  SH_CLERK     2500  0     120   50
113  Luis         Popp         LPOPP     515.124.4567        1987-06-30  FI_ACCOUNT   6900  0     108  100
160  Louise       Doran        LDORAN    011.44.1345.629268  1987-08-16  SA_REP       7500  0.3   146   80
168  Lisa         Ozer         LOZER     011.44.1343.929268  1987-08-24  SA_REP      11500  0.25  148   80
159  Lindsey      Smith        LSMITH    011.44.1345.729268  1987-08-15  SA_REP       8000  0.3   146   80
102  Lex          De Haan      LDEHAAN   515.123.4569        1987-06-19  AD_VP       17000  0     100   90
129  Laura        Bissot       LBISSOT   650.124.5234        1987-07-16  ST_CLERK     3300  0     121   50
178  Kimberely    Grant        KGRANT    011.44.1644.429263  1987-09-03  SA_REP       7000  0.15  149    0
135  Ki           Gee          KGEE      650.127.1734        1987-07-22  ST_CLERK     2400  0     122   50
124  Kevin        Mourgos      KMOURGOS  650.123.5234        1987-07-11  ST_MAN       5800  0     100   50
197  Kevin        Feeney       KFEENEY   650.507.9822        1987-09-22  SH_CLERK     3000  0     124   50
188  Kelly        Chung        KCHUNG    650.505.1876        1987-09-13  SH_CLERK     3800  0     122   50
119  Karen        Colmenares   KCOLMENA  515.127.4566        1987-07-06  PU_CLERK     2500  0     114   30
146  Karen        Partners     KPARTNER  011.44.1344.467268  1987-08-02  SA_MAN      13500  0.3   100   80
125  Julia        Nayer        JNAYER    650.124.1214        1987-07-12  ST_CLERK     3200  0     120   50
186  Julia        Dellinger    JDELLING  650.509.3876        1987-09-11  SH_CLERK     3400  0     121   50
140  Joshua       Patel        JPATEL    650.121.1834        1987-07-27  ST_CLERK     2500  0     123   50
112  Jose Manuel  Urman        JMURMAN   515.124.4469        1987-06-29  FI_ACCOUNT   7800  0     108  100
176  Jonathon     Taylor       JTAYLOR   011.44.1644.429265  1987-09-01  SA_REP       8600  0.2   149   80
110  John         Chen         JCHEN     515.124.4269        1987-06-27  FI_ACCOUNT   8200  0     108  100
139  John         Seo          JSEO      650.121.2019        1987-07-26  ST_CLERK     2700  0     123   50
145  John         Russell      JRUSSEL   011.44.1344.429268  1987-08-01  SA_MAN      14000  0.4   100   80
189  Jennifer     Dilly        JDILLY    650.505.2876        1987-09-14  SH_CLERK     3600  0     122   50
200  Jennifer     Whalen       JWHALEN   515.123.4444        1987-09-25  AD_ASST      4400  0     101   10
181  Jean         Fleaur       JFLEAUR   650.507.9877        1987-09-06  SH_CLERK     3100  0     120   50
133  Jason        Mallin       JMALLIN   650.127.1934        1987-07-20  ST_CLERK     3300  0     122   50
156  Janette      King         JKING     011.44.1345.429268  1987-08-12  SA_REP      10000  0.35  146   80
127  James        Landry       JLANDRY   650.124.1334        1987-07-14  ST_CLERK     2400  0     120   50
131  James        Marlow       JAMRLOW   650.124.7234        1987-07-18  ST_CLERK     2500  0     121   50
177  Jack         Livingston   JLIVINGS  011.44.1644.429264  1987-09-02  SA_REP       8400  0.2   149   80
111  Ismael       Sciarra      ISCIARRA  515.124.4369        1987-06-28  FI_ACCOUNT   7700  0     108  100
126  Irene        Mikkilineni  IMIKKILI  650.124.1224        1987-07-13  ST_CLERK     2700  0     120   50
204  Hermann      Baer         HBAER     515.123.8888        1987-09-29  PR_REP      10000  0     101   70
136  Hazel        Philtanker   HPHILTAN  650.127.1634        1987-07-23  ST_CLERK     2200  0     122   50
169  Harrison     Bloom        HBLOOM    011.44.1343.829268  1987-08-25  SA_REP      10000  0.2   148   80
118  Guy          Himuro       GHIMURO   515.127.4565        1987-07-05  PU_CLERK     2600  0     114   30
183  Girard       Geoni        GGEONI    650.507.9879        1987-09-08  SH_CLERK     2800  0     120   50
148  Gerald       Cambrault    GCAMBRAU  011.44.1344.619268  1987-08-04  SA_MAN      11000  0.3   100   80
174  Ellen        Abel         EABEL     011.44.1644.429267  1987-08-30  SA_REP      11000  0.3   149   80
172  Elizabeth    Bates        EBATES    011.44.1343.529268  1987-08-28  SA_REP       7300  0.15  148   80
149  Eleni        Zlotkey      EZLOTKEY  011.44.1344.429018  1987-08-05  SA_MAN      10500  0.2   100   80
199  Douglas      Grant        DGRANT    650.507.9844        1987-09-24  SH_CLERK     2600  0     124   50
198  Donald       OConnell     DOCONNEL  650.507.9833        1987-09-23  SH_CLERK     2600  0     124   50
107  Diana        Lorentz      DLORENTZ  590.423.5567        1987-06-24  IT_PROG      4200  0     103   60
114  Den          Raphaely     DRAPHEAL  515.127.4561        1987-07-01  PU_MAN      11000  0     100   30
105  David        Austin       DAUSTIN   590.423.4569        1987-06-22  IT_PROG      4800  0     103   60
151  David        Bernstein    DBERNSTE  011.44.1344.345268  1987-08-07  SA_REP       9500  0.25  145   80
165  David        Lee          DLEE      011.44.1346.529268  1987-08-21  SA_REP       6800  0.1   147   80
163  Danielle     Greene       DGREENE   011.44.1346.229268  1987-08-19  SA_REP       9500  0.15  147   80
109  Daniel       Faviet       DFAVIET   515.124.4169        1987-06-26  FI_ACCOUNT   9000  0     108  100
142  Curtis       Davies       CDAVIES   650.121.2994        1987-07-29  ST_CLERK     3100  0     124   50
162  Clara        Vishney      CVISHNEY  011.44.1346.129268  1987-08-18  SA_REP      10500  0.25  147   80
153  Christopher  Olsen        COLSEN    011.44.1344.498718  1987-08-09  SA_REP       8000  0.2   145   80
179  Charles      Johnson      CJOHNSON  011.44.1644.429262  1987-09-04  SA_REP       6200  0.1   149   80
104  Bruce        Ernst        BERNST    590.423.4568        1987-06-21  IT_PROG      6000  0     103   60
193  Britney      Everett      BEVERETT  650.501.2876        1987-09-18  SH_CLERK     3900  0     123   50
187  Anthony      Cabrio       ACABRIO   650.509.4876        1987-09-12  SH_CLERK     3000  0     121   50
167  Amit         Banda        ABANDA    011.44.1346.729268  1987-08-23  SA_REP       6200  0.1   147   80
175  Alyssa       Hutton       AHUTTON   011.44.1644.429266  1987-08-31  SA_REP       8800  0.25  149   80
158  Allan        McEwen       AMCEWEN   011.44.1345.829268  1987-08-14  SA_REP       9000  0.35  146   80
185  Alexis       Bull         ABULL     650.509.2876        1987-09-10  SH_CLERK     4100  0     121   50
103  Alexander    Hunold       AHUNOLD   590.423.4567        1987-06-20  IT_PROG      9000  0     102   60
115  Alexander    Khoo         AKHOO     515.127.4562        1987-07-02  PU_CLERK     3100  0     114   30
147  Alberto      Errazuriz    AERRAZUR  011.44.1344.429278  1987-08-03  SA_MAN      12000  0.3   100   80
196  Alana        Walsh        AWALSH    650.507.9811        1987-09-21  SH_CLERK     3100  0     124   50
121  Adam         Fripp        AFRIPP    650.123.2234        1987-07-08  ST_MAN       8200  0     100   50
---  -----------  -----------  --------  ------------------  ----------  ----------  -----  ----  ---  ---

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

In [43]:
cur.execute("SELECT first_name,last_name,salary,salary*0.12 'PF' FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------  -----  ----
Steven       King         24000  2880
Neena        Kochhar      17000  2040
Lex          De Haan      17000  2040
Alexander    Hunold        9000  1080
Bruce        Ernst         6000   720
David        Austin        4800   576
Valli        Pataballa     4800   576
Diana        Lorentz       4200   504
Nancy        Greenberg    12000  1440
Daniel       Faviet        9000  1080
John         Chen          8200   984
Ismael       Sciarra       7700   924
Jose Manuel  Urman         7800   936
Luis         Popp          6900   828
Den          Raphaely     11000  1320
Alexander    Khoo          3100   372
Shelli       Baida         2900   348
Sigal        Tobias        2800   336
Guy          Himuro        2600   312
Karen        Colmenares    2500   300
Matthew      Weiss         8000   960
Adam         Fripp         8200   984
Payam        Kaufling      7900   948
Shanta       Vollman       6500   780
Kevin        Mourgos       5800   696
Julia        Nayer         3200   384
Irene        Mikkilineni   2700   324
James        Landry        2400   288
Steven       Markle        2200   264
Laura        Bissot        3300   396
Mozhe        Atkinson      2800   336
James        Marlow        2500   300
TJ           Olson         2100   252
Jason        Mallin        3300   396
Michael      Rogers        2900   348
Ki           Gee           2400   288
Hazel        Philtanker    2200   264
Renske       Ladwig        3600   432
Stephen      Stiles        3200   384
John         Seo           2700   324
Joshua       Patel         2500   300
Trenna       Rajs          3500   420
Curtis       Davies        3100   372
Randall      Matos         2600   312
Peter        Vargas        2500   300
John         Russell      14000  1680
Karen        Partners     13500  1620
Alberto      Errazuriz    12000  1440
Gerald       Cambrault    11000  1320
Eleni        Zlotkey      10500  1260
Peter        Tucker       10000  1200
David        Bernstein     9500  1140
Peter        Hall          9000  1080
Christopher  Olsen         8000   960
Nanette      Cambrault     7500   900
Oliver       Tuvault       7000   840
Janette      King         10000  1200
Patrick      Sully         9500  1140
Allan        McEwen        9000  1080
Lindsey      Smith         8000   960
Louise       Doran         7500   900
Sarath       Sewall        7000   840
Clara        Vishney      10500  1260
Danielle     Greene        9500  1140
Mattea       Marvins       7200   864
David        Lee           6800   816
Sundar       Ande          6400   768
Amit         Banda         6200   744
Lisa         Ozer         11500  1380
Harrison     Bloom        10000  1200
Tayler       Fox           9600  1152
William      Smith         7400   888
Elizabeth    Bates         7300   876
Sundita      Kumar         6100   732
Ellen        Abel         11000  1320
Alyssa       Hutton        8800  1056
Jonathon     Taylor        8600  1032
Jack         Livingston    8400  1008
Kimberely    Grant         7000   840
Charles      Johnson       6200   744
Winston      Taylor        3200   384
Jean         Fleaur        3100   372
Martha       Sullivan      2500   300
Girard       Geoni         2800   336
Nandita      Sarchand      4200   504
Alexis       Bull          4100   492
Julia        Dellinger     3400   408
Anthony      Cabrio        3000   360
Kelly        Chung         3800   456
Jennifer     Dilly         3600   432
Timothy      Gates         2900   348
Randall      Perkins       2500   300
Sarah        Bell          4000   480
Britney      Everett       3900   468
Samuel       McCain        3200   384
Vance        Jones         2800   336
Alana        Walsh         3100   372
Kevin        Feeney        3000   360
Donald       OConnell      2600   312
Douglas      Grant         2600   312
Jennifer     Whalen        4400   528
Michael      Hartstein    13000  1560
Pat          Fay           6000   720
Susan        Mavris        6500   780
Hermann      Baer         10000  1200
Shelley      Higgins      12000  1440
William      Gietz         8300   996
-----------  -----------  -----  ----

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

In [15]:
cur.execute("SELECT first_name , last_name n, salary FROM employees ORDER BY salary ASC;")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------  -----
TJ           Olson         2100
Steven       Markle        2200
Hazel        Philtanker    2200
James        Landry        2400
Ki           Gee           2400
Karen        Colmenares    2500
James        Marlow        2500
Joshua       Patel         2500
Peter        Vargas        2500
Martha       Sullivan      2500
Randall      Perkins       2500
Guy          Himuro        2600
Randall      Matos         2600
Donald       OConnell      2600
Douglas      Grant         2600
Irene        Mikkilineni   2700
John         Seo           2700
Sigal        Tobias        2800
Mozhe        Atkinson      2800
Girard       Geoni         2800
Vance        Jones         2800
Shelli       Baida         2900
Michael      Rogers        2900
Timothy      Gates         2900
Anthony      Cabrio        3000
Kevin        Feeney        3000
Alexander    Khoo          3100
Curtis       Davies        3100
Jean         Fleaur        3100
Alana        Walsh         3100
Julia        Nayer         3200
Stephen      Stiles        3200
Winston      Taylor        3200
Samuel       McCain        3200
Laura        Bissot        3300
Jason        Mallin        3300
Julia        Dellinger     3400
Trenna       Rajs          3500
Renske       Ladwig        3600
Jennifer     Dilly         3600
Kelly        Chung         3800
Britney      Everett       3900
Sarah        Bell          4000
Alexis       Bull          4100
Diana        Lorentz       4200
Nandita      Sarchand      4200
Jennifer     Whalen        4400
David        Austin        4800
Valli        Pataballa     4800
Kevin        Mourgos       5800
Bruce        Ernst         6000
Pat          Fay           6000
Sundita      Kumar         6100
Amit         Banda         6200
Charles      Johnson       6200
Sundar       Ande          6400
Shanta       Vollman       6500
Susan        Mavris        6500
David        Lee           6800
Luis         Popp          6900
Oliver       Tuvault       7000
Sarath       Sewall        7000
Kimberely    Grant         7000
Mattea       Marvins       7200
Elizabeth    Bates         7300
William      Smith         7400
Nanette      Cambrault     7500
Louise       Doran         7500
Ismael       Sciarra       7700
Jose Manuel  Urman         7800
Payam        Kaufling      7900
Matthew      Weiss         8000
Christopher  Olsen         8000
Lindsey      Smith         8000
John         Chen          8200
Adam         Fripp         8200
William      Gietz         8300
Jack         Livingston    8400
Jonathon     Taylor        8600
Alyssa       Hutton        8800
Alexander    Hunold        9000
Daniel       Faviet        9000
Peter        Hall          9000
Allan        McEwen        9000
David        Bernstein     9500
Patrick      Sully         9500
Danielle     Greene        9500
Tayler       Fox           9600
Peter        Tucker       10000
Janette      King         10000
Harrison     Bloom        10000
Hermann      Baer         10000
Eleni        Zlotkey      10500
Clara        Vishney      10500
Den          Raphaely     11000
Gerald       Cambrault    11000
Ellen        Abel         11000
Lisa         Ozer         11500
Nancy        Greenberg    12000
Alberto      Errazuriz    12000
Shelley      Higgins      12000
Michael      Hartstein    13000
Karen        Partners     13500
John         Russell      14000
Neena        Kochhar      17000
Lex          De Haan      17000
Steven       King         24000
-----------  -----------  -----

+ Write a query to get the total salaries payable to employees on the table "employees"

In [16]:
cur.execute("SELECT SUM(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

------
691400
------

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

In [17]:
cur.execute("SELECT max(salary),min(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----  ----
24000  2100
-----  ----

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

In [18]:
cur.execute("SELECT  sum(salary)/count(*),count(*),AVG(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

#a primeira foi como eu pensei em fazer, a segunda foi cola

----  ---  -------
6461  107  6461.68
----  ---  -------

+ Write a query to get the number of employees working with the company on the table "employees"

In [19]:
cur.execute("SELECT count(*) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

---
107
---

+ Write a query to get the number of jobs available in the employees table on the table "employees"

+ Write a query get all first name from employees table in upper case on the table "employees"

In [20]:
cur.execute("SELECT  upper(first_name) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----------
STEVEN
NEENA
LEX
ALEXANDER
BRUCE
DAVID
VALLI
DIANA
NANCY
DANIEL
JOHN
ISMAEL
JOSE MANUEL
LUIS
DEN
ALEXANDER
SHELLI
SIGAL
GUY
KAREN
MATTHEW
ADAM
PAYAM
SHANTA
KEVIN
JULIA
IRENE
JAMES
STEVEN
LAURA
MOZHE
JAMES
TJ
JASON
MICHAEL
KI
HAZEL
RENSKE
STEPHEN
JOHN
JOSHUA
TRENNA
CURTIS
RANDALL
PETER
JOHN
KAREN
ALBERTO
GERALD
ELENI
PETER
DAVID
PETER
CHRISTOPHER
NANETTE
OLIVER
JANETTE
PATRICK
ALLAN
LINDSEY
LOUISE
SARATH
CLARA
DANIELLE
MATTEA
DAVID
SUNDAR
AMIT
LISA
HARRISON
TAYLER
WILLIAM
ELIZABETH
SUNDITA
ELLEN
ALYSSA
JONATHON
JACK
KIMBERELY
CHARLES
WINSTON
JEAN
MARTHA
GIRARD
NANDITA
ALEXIS
JULIA
ANTHONY
KELLY
JENNIFER
TIMOTHY
RANDALL
SARAH
BRITNEY
SAMUEL
VANCE
ALANA
KEVIN
DONALD
DOUGLAS
JENNIFER
MICHAEL
PAT
SUSAN
HERMANN
SHELLEY
WILLIAM
-----------

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

In [21]:
cur.execute("SELECT SUBSTR(first_name,1,3) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

---
Ste
Nee
Lex
Ale
Bru
Dav
Val
Dia
Nan
Dan
Joh
Ism
Jos
Lui
Den
Ale
She
Sig
Guy
Kar
Mat
Ada
Pay
Sha
Kev
Jul
Ire
Jam
Ste
Lau
Moz
Jam
TJ
Jas
Mic
Ki
Haz
Ren
Ste
Joh
Jos
Tre
Cur
Ran
Pet
Joh
Kar
Alb
Ger
Ele
Pet
Dav
Pet
Chr
Nan
Oli
Jan
Pat
All
Lin
Lou
Sar
Cla
Dan
Mat
Dav
Sun
Ami
Lis
Har
Tay
Wil
Eli
Sun
Ell
Aly
Jon
Jac
Kim
Cha
Win
Jea
Mar
Gir
Nan
Ale
Jul
Ant
Kel
Jen
Tim
Ran
Sar
Bri
Sam
Van
Ala
Kev
Don
Dou
Jen
Mic
Pat
Sus
Her
She
Wil
---

+ Write a query to calculate 171*214+625.

In [22]:
cur.execute("SELECT  (171*214)+625")
print(tabulate.tabulate(cur.fetchall()))

-----
37219
-----

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

In [23]:
cur.execute("SELECT  first_name || ' ' || last_name AS Nome  FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----------------
Steven King
Neena Kochhar
Lex De Haan
Alexander Hunold
Bruce Ernst
David Austin
Valli Pataballa
Diana Lorentz
Nancy Greenberg
Daniel Faviet
John Chen
Ismael Sciarra
Jose Manuel Urman
Luis Popp
Den Raphaely
Alexander Khoo
Shelli Baida
Sigal Tobias
Guy Himuro
Karen Colmenares
Matthew Weiss
Adam Fripp
Payam Kaufling
Shanta Vollman
Kevin Mourgos
Julia Nayer
Irene Mikkilineni
James Landry
Steven Markle
Laura Bissot
Mozhe Atkinson
James Marlow
TJ Olson
Jason Mallin
Michael Rogers
Ki Gee
Hazel Philtanker
Renske Ladwig
Stephen Stiles
John Seo
Joshua Patel
Trenna Rajs
Curtis Davies
Randall Matos
Peter Vargas
John Russell
Karen Partners
Alberto Errazuriz
Gerald Cambrault
Eleni Zlotkey
Peter Tucker
David Bernstein
Peter Hall
Christopher Olsen
Nanette Cambrault
Oliver Tuvault
Janette King
Patrick Sully
Allan McEwen
Lindsey Smith
Louise Doran
Sarath Sewall
Clara Vishney
Danielle Greene
Mattea Marvins
David Lee
Sundar Ande
Amit Banda
Lisa Ozer
Harrison Bloom
Tayler Fox
William Smith
Elizabeth Bates
Sundita Kumar
Ellen Abel
Alyssa Hutton
Jonathon Taylor
Jack Livingston
Kimberely Grant
Charles Johnson
Winston Taylor
Jean Fleaur
Martha Sullivan
Girard Geoni
Nandita Sarchand
Alexis Bull
Julia Dellinger
Anthony Cabrio
Kelly Chung
Jennifer Dilly
Timothy Gates
Randall Perkins
Sarah Bell
Britney Everett
Samuel McCain
Vance Jones
Alana Walsh
Kevin Feeney
Donald OConnell
Douglas Grant
Jennifer Whalen
Michael Hartstein
Pat Fay
Susan Mavris
Hermann Baer
Shelley Higgins
William Gietz
-----------------

+ Write a query to get first name from employees table after removing white spaces from both side on the table "employees"

In [24]:
cur.execute("SELECT  TRIM(first_name) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----------
Steven
Neena
Lex
Alexander
Bruce
David
Valli
Diana
Nancy
Daniel
John
Ismael
Jose Manuel
Luis
Den
Alexander
Shelli
Sigal
Guy
Karen
Matthew
Adam
Payam
Shanta
Kevin
Julia
Irene
James
Steven
Laura
Mozhe
James
TJ
Jason
Michael
Ki
Hazel
Renske
Stephen
John
Joshua
Trenna
Curtis
Randall
Peter
John
Karen
Alberto
Gerald
Eleni
Peter
David
Peter
Christopher
Nanette
Oliver
Janette
Patrick
Allan
Lindsey
Louise
Sarath
Clara
Danielle
Mattea
David
Sundar
Amit
Lisa
Harrison
Tayler
William
Elizabeth
Sundita
Ellen
Alyssa
Jonathon
Jack
Kimberely
Charles
Winston
Jean
Martha
Girard
Nandita
Alexis
Julia
Anthony
Kelly
Jennifer
Timothy
Randall
Sarah
Britney
Samuel
Vance
Alana
Kevin
Donald
Douglas
Jennifer
Michael
Pat
Susan
Hermann
Shelley
William
-----------

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

In [25]:
cur.execute("SELECT  LENGTH(first_name) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

--
 6
 5
 3
 9
 5
 5
 5
 5
 5
 6
 4
 6
11
 4
 3
 9
 6
 5
 3
 5
 7
 4
 5
 6
 5
 5
 5
 5
 6
 5
 5
 5
 2
 5
 7
 2
 5
 6
 7
 4
 6
 6
 6
 7
 5
 4
 5
 7
 6
 5
 5
 5
 5
11
 7
 6
 7
 7
 5
 7
 6
 6
 5
 8
 6
 5
 6
 4
 4
 8
 6
 7
 9
 7
 5
 6
 8
 4
 9
 7
 7
 4
 6
 6
 7
 6
 5
 7
 5
 8
 7
 7
 5
 7
 6
 5
 5
 5
 6
 7
 8
 7
 3
 5
 7
 7
 7
--

+ Write a query to select first 10 records from a table on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"

In [26]:
cur.execute("SELECT  ROUND(CAST(salary as REAL)/12,2) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-------
2000
1416.67
1416.67
 750
 500
 400
 400
 350
1000
 750
 683.33
 641.67
 650
 575
 916.67
 258.33
 241.67
 233.33
 216.67
 208.33
 666.67
 683.33
 658.33
 541.67
 483.33
 266.67
 225
 200
 183.33
 275
 233.33
 208.33
 175
 275
 241.67
 200
 183.33
 300
 266.67
 225
 208.33
 291.67
 258.33
 216.67
 208.33
1166.67
1125
1000
 916.67
 875
 833.33
 791.67
 750
 666.67
 625
 583.33
 833.33
 791.67
 750
 666.67
 625
 583.33
 875
 791.67
 600
 566.67
 533.33
 516.67
 958.33
 833.33
 800
 616.67
 608.33
 508.33
 916.67
 733.33
 716.67
 700
 583.33
 516.67
 266.67
 258.33
 208.33
 233.33
 350
 341.67
 283.33
 250
 316.67
 300
 241.67
 208.33
 333.33
 325
 266.67
 233.33
 258.33
 250
 216.67
 216.67
 366.67
1083.33
 500
 541.67
 833.33
1000
 691.67
-------

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

In [27]:
cur.execute("SELECT  first_name, last_name , salary FROM employees WHERE salary > 15000 OR salary < 10000 ;")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------  -----
Steven       King         24000
Neena        Kochhar      17000
Lex          De Haan      17000
Alexander    Hunold        9000
Bruce        Ernst         6000
David        Austin        4800
Valli        Pataballa     4800
Diana        Lorentz       4200
Daniel       Faviet        9000
John         Chen          8200
Ismael       Sciarra       7700
Jose Manuel  Urman         7800
Luis         Popp          6900
Alexander    Khoo          3100
Shelli       Baida         2900
Sigal        Tobias        2800
Guy          Himuro        2600
Karen        Colmenares    2500
Matthew      Weiss         8000
Adam         Fripp         8200
Payam        Kaufling      7900
Shanta       Vollman       6500
Kevin        Mourgos       5800
Julia        Nayer         3200
Irene        Mikkilineni   2700
James        Landry        2400
Steven       Markle        2200
Laura        Bissot        3300
Mozhe        Atkinson      2800
James        Marlow        2500
TJ           Olson         2100
Jason        Mallin        3300
Michael      Rogers        2900
Ki           Gee           2400
Hazel        Philtanker    2200
Renske       Ladwig        3600
Stephen      Stiles        3200
John         Seo           2700
Joshua       Patel         2500
Trenna       Rajs          3500
Curtis       Davies        3100
Randall      Matos         2600
Peter        Vargas        2500
David        Bernstein     9500
Peter        Hall          9000
Christopher  Olsen         8000
Nanette      Cambrault     7500
Oliver       Tuvault       7000
Patrick      Sully         9500
Allan        McEwen        9000
Lindsey      Smith         8000
Louise       Doran         7500
Sarath       Sewall        7000
Danielle     Greene        9500
Mattea       Marvins       7200
David        Lee           6800
Sundar       Ande          6400
Amit         Banda         6200
Tayler       Fox           9600
William      Smith         7400
Elizabeth    Bates         7300
Sundita      Kumar         6100
Alyssa       Hutton        8800
Jonathon     Taylor        8600
Jack         Livingston    8400
Kimberely    Grant         7000
Charles      Johnson       6200
Winston      Taylor        3200
Jean         Fleaur        3100
Martha       Sullivan      2500
Girard       Geoni         2800
Nandita      Sarchand      4200
Alexis       Bull          4100
Julia        Dellinger     3400
Anthony      Cabrio        3000
Kelly        Chung         3800
Jennifer     Dilly         3600
Timothy      Gates         2900
Randall      Perkins       2500
Sarah        Bell          4000
Britney      Everett       3900
Samuel       McCain        3200
Vance        Jones         2800
Alana        Walsh         3100
Kevin        Feeney        3000
Donald       OConnell      2600
Douglas      Grant         2600
Jennifer     Whalen        4400
Pat          Fay           6000
Susan        Mavris        6500
William      Gietz         8300
-----------  -----------  -----

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

In [45]:
cur.execute("SELECT  first_name,last_name,department_id FROM employees WHERE department_id == 30 or department_id == 100 ORDER BY department_id DESC,first_name ASC;")
print(tabulate.tabulate(cur.fetchall()))

-----------  ----------  ---
Daniel       Faviet      100
Ismael       Sciarra     100
John         Chen        100
Jose Manuel  Urman       100
Luis         Popp        100
Nancy        Greenberg   100
Alexander    Khoo         30
Den          Raphaely     30
Guy          Himuro       30
Karen        Colmenares   30
Shelli       Baida        30
Sigal        Tobias       30
-----------  ----------  ---

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

In [29]:
cur.execute("SELECT  first_name, last_name ,department_id, salary FROM employees WHERE (salary > 15000 OR salary < 10000) AND department_id IN (30,100);")
print(tabulate.tabulate(cur.fetchall()))

-----------  ----------  ---  ----
Daniel       Faviet      100  9000
John         Chen        100  8200
Ismael       Sciarra     100  7700
Jose Manuel  Urman       100  7800
Luis         Popp        100  6900
Alexander    Khoo         30  3100
Shelli       Baida        30  2900
Sigal        Tobias       30  2800
Guy          Himuro       30  2600
Karen        Colmenares   30  2500
-----------  ----------  ---  ----

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

In [56]:
cur.execute("SELECT first_name FROM employees WHERE first_name LIKE '%b%' OR first_name LIKE '%c%';")
print(tabulate.tabulate(cur.fetchall()))

-----------
Bruce
Nancy
Michael
Curtis
Alberto
Christopher
Patrick
Clara
Elizabeth
Jack
Kimberely
Charles
Britney
Vance
Michael
-----------

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

In [83]:
cur.execute("SELECT last_name, job_id, salary FROM employees WHERE job_id IN ('IT_PROG','ST_CLERK') AND salary NOT IN (4500,10000,150000);")
print(tabulate.tabulate(cur.fetchall()))

-----------  --------  ----
Hunold       IT_PROG   9000
Ernst        IT_PROG   6000
Austin       IT_PROG   4800
Pataballa    IT_PROG   4800
Lorentz      IT_PROG   4200
Nayer        ST_CLERK  3200
Mikkilineni  ST_CLERK  2700
Landry       ST_CLERK  2400
Markle       ST_CLERK  2200
Bissot       ST_CLERK  3300
Atkinson     ST_CLERK  2800
Marlow       ST_CLERK  2500
Olson        ST_CLERK  2100
Mallin       ST_CLERK  3300
Rogers       ST_CLERK  2900
Gee          ST_CLERK  2400
Philtanker   ST_CLERK  2200
Ladwig       ST_CLERK  3600
Stiles       ST_CLERK  3200
Seo          ST_CLERK  2700
Patel        ST_CLERK  2500
Rajs         ST_CLERK  3500
Davies       ST_CLERK  3100
Matos        ST_CLERK  2600
Vargas       ST_CLERK  2500
-----------  --------  ----

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

In [59]:
cur.execute("SELECT last_name FROM employees WHERE LENGTH(first_name) == 6  ;")
print(tabulate.tabulate(cur.fetchall()))

---------
King
Faviet
Sciarra
Baida
Vollman
Markle
Ladwig
Patel
Rajs
Davies
Cambrault
Tuvault
Doran
Sewall
Marvins
Ande
Fox
Hutton
Sullivan
Geoni
Bull
McCain
OConnell
---------

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

In [74]:
cur.execute("SELECT last_name FROM employees WHERE last_name LIKE '__e%' ;")
print(tabulate.tabulate(cur.fetchall()))

---------
Greenberg
Chen
Gee
McEwen
Greene
Lee
Ozer
Abel
Fleaur
Everett
Feeney
Baer
Gietz
---------

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

In [86]:
cur.execute("SELECT DISTINCT job_title FROM jobs;")
print(tabulate.tabulate(cur.fetchall()))

-------------------------------
job_title
President
Administration Vice President
Administration Assistant
Finance Manager
Accountant
Accounting Manager
Public Accountant
Sales Manager
Sales Representative
Purchasing Manager
Purchasing Clerk
Stock Manager
Stock Clerk
Shipping Clerk
Programmer
Marketing Manager
Marketing Representative
Human Resources Representative
Public Relations Representative
-------------------------------

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

In [ ]:
cur.execute("SELECT first_name,last_name,salary,salary*0.15 'PF' FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

+ Write a query to list the number of jobs available in the employees table.

In [87]:
cur.execute("SELECT DISTINCT job_id FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

----------
AD_PRES
AD_VP
IT_PROG
FI_MGR
FI_ACCOUNT
PU_MAN
PU_CLERK
ST_MAN
ST_CLERK
SA_MAN
SA_REP
SH_CLERK
AD_ASST
MK_MAN
MK_REP
HR_REP
PR_REP
AC_MGR
AC_ACCOUNT
----------

+ Write a query to get the total salaries payable to employees.

In [88]:
cur.execute("SELECT sum(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

------
691400
------

+ Write a query to get the minimum salary from employees table.

In [90]:
cur.execute("SELECT min(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

----
2100
----

+ Write a query to get the maximum salary of an employee working as a Programmer.

In [ ]:
cur.execute("SELECT max(salary) FROM employees WHERE job_id == "IT_PROG";")
print(tabulate.tabulate(cur.fetchall()))

+ Write a query to get the average salary and number of employees working the department 90.

In [93]:
cur.execute("SELECT AVG(salary) FROM employees WHERE department_id == 90;")
print(tabulate.tabulate(cur.fetchall()))

-------
19333.3
-------

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

In [94]:
cur.execute("SELECT max(salary),min(salary),avg(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----  ----  -------
24000  2100  6461.68
-----  ----  -------

+ Write a query to get the number of employees with the same job.

In [98]:
cur.execute("SELECT distinct job_id,LENGTH(job_id) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

----------  --
AD_PRES      7
AD_VP        5
IT_PROG      7
FI_MGR       6
FI_ACCOUNT  10
PU_MAN       6
PU_CLERK     8
ST_MAN       6
ST_CLERK     8
SA_MAN       6
SA_REP       6
SH_CLERK     8
AD_ASST      7
MK_MAN       6
MK_REP       6
HR_REP       6
PR_REP       6
AC_MGR       6
AC_ACCOUNT  10
----------  --

+ Write a query to get the difference between the highest and lowest salaries.

In [105]:
cur.execute("SELECT max(salary)-min(salary) FROM employees;")
print(tabulate.tabulate(cur.fetchall()))

-----
21900
-----

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

+ Write a query to get the department ID and the total salary payable in each department.

In [106]:
cur.execute("SELECT department_id, SUM(salary) FROM employees GROUP BY department_id;")
print(tabulate.tabulate(cur.fetchall()))

---  ------
  0    7000
 10    4400
 20   19000
 30   24900
 40    6500
 50  156400
 60   28800
 70   10000
 80  304500
 90   58000
100   51600
110   20300
---  ------

+ Write a query to get the average salary for each job ID excluding programmer.

In [112]:
cur.execute("SELECT job_id, SUM(salary) FROM employees WHERE job_id != 'IT_PROG' GROUP BY job_id ;")
print(tabulate.tabulate(cur.fetchall()))

----------  ------
AC_ACCOUNT    8300
AC_MGR       12000
AD_ASST       4400
AD_PRES      24000
AD_VP        34000
FI_ACCOUNT   39600
FI_MGR       12000
HR_REP        6500
MK_MAN       13000
MK_REP        6000
PR_REP       10000
PU_CLERK     13900
PU_MAN       11000
SA_MAN       61000
SA_REP      250500
SH_CLERK     64300
ST_CLERK     55700
ST_MAN       36400
----------  ------

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

In [115]:
cur.execute("SELECT job_id, SUM(salary),min(salary),max(salary),avg(salary) FROM employees WHERE department_id == 90 GROUP BY job_id ;")
print(tabulate.tabulate(cur.fetchall()))

-------  -----  -----  -----  -----
AD_PRES  24000  24000  24000  24000
AD_VP    34000  17000  17000  17000
-------  -----  -----  -----  -----

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

In [118]:
cur.execute("SELECT job_id, max(salary) FROM employees WHERE salary >= 4000 GROUP BY job_id ;")
print(tabulate.tabulate(cur.fetchall()))

----------  -----
AC_ACCOUNT   8300
AC_MGR      12000
AD_ASST      4400
AD_PRES     24000
AD_VP       17000
FI_ACCOUNT   9000
FI_MGR      12000
HR_REP       6500
IT_PROG      9000
MK_MAN      13000
MK_REP       6000
PR_REP      10000
PU_MAN      11000
SA_MAN      14000
SA_REP      11500
SH_CLERK     4200
ST_MAN       8200
----------  -----

+ Write a query to get the average salary for all departments employing more than 10 employees.

In [128]:
cur.execute("SELECT avg(salary) FROM employees WHERE length(department_id > 10) GROUP BY job_id ;")
print(tabulate.tabulate(cur.fetchall()))

-----
 8300
12000
 4400
24000
17000
 7920
12000
 6500
 5760
13000
 6000
10000
 2780
11000
12200
 8350
 3215
 2785
 7280
-----

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

In [132]:
cur.execute("SELECT FIRST_NAME, LAST_NAME, SALARY FROM employees WHERE SALARY > (SELECT salary FROM employees WHERE last_name = 'Bull');")
print(tabulate.tabulate(cur.fetchall()))

-----------  ----------  -----
Steven       King        24000
Neena        Kochhar     17000
Lex          De Haan     17000
Alexander    Hunold       9000
Bruce        Ernst        6000
David        Austin       4800
Valli        Pataballa    4800
Diana        Lorentz      4200
Nancy        Greenberg   12000
Daniel       Faviet       9000
John         Chen         8200
Ismael       Sciarra      7700
Jose Manuel  Urman        7800
Luis         Popp         6900
Den          Raphaely    11000
Matthew      Weiss        8000
Adam         Fripp        8200
Payam        Kaufling     7900
Shanta       Vollman      6500
Kevin        Mourgos      5800
John         Russell     14000
Karen        Partners    13500
Alberto      Errazuriz   12000
Gerald       Cambrault   11000
Eleni        Zlotkey     10500
Peter        Tucker      10000
David        Bernstein    9500
Peter        Hall         9000
Christopher  Olsen        8000
Nanette      Cambrault    7500
Oliver       Tuvault      7000
Janette      King        10000
Patrick      Sully        9500
Allan        McEwen       9000
Lindsey      Smith        8000
Louise       Doran        7500
Sarath       Sewall       7000
Clara        Vishney     10500
Danielle     Greene       9500
Mattea       Marvins      7200
David        Lee          6800
Sundar       Ande         6400
Amit         Banda        6200
Lisa         Ozer        11500
Harrison     Bloom       10000
Tayler       Fox          9600
William      Smith        7400
Elizabeth    Bates        7300
Sundita      Kumar        6100
Ellen        Abel        11000
Alyssa       Hutton       8800
Jonathon     Taylor       8600
Jack         Livingston   8400
Kimberely    Grant        7000
Charles      Johnson      6200
Nandita      Sarchand     4200
Jennifer     Whalen       4400
Michael      Hartstein   13000
Pat          Fay          6000
Susan        Mavris       6500
Hermann      Baer        10000
Shelley      Higgins     12000
William      Gietz        8300
-----------  ----------  -----

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

In [122]:
cur.execute("SELECT first_name, last_name from employees where job_id == 'IT_PROG';")
print(tabulate.tabulate(cur.fetchall()))

---------  ---------
Alexander  Hunold
Bruce      Ernst
David      Austin
Valli      Pataballa
Diana      Lorentz
---------  ---------

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

In [129]:
cur.execute("SELECT first_name, last_name FROM employees WHERE manager_id in (select employee_id FROM employees WHERE department_id IN (SELECT department_id FROM departments WHERE location_id IN (select location_id from locations where country_id='US')));")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------
Neena        Kochhar
Lex          De Haan
Alexander    Hunold
Bruce        Ernst
David        Austin
Valli        Pataballa
Diana        Lorentz
Nancy        Greenberg
Daniel       Faviet
John         Chen
Ismael       Sciarra
Jose Manuel  Urman
Luis         Popp
Den          Raphaely
Alexander    Khoo
Shelli       Baida
Sigal        Tobias
Guy          Himuro
Karen        Colmenares
Matthew      Weiss
Adam         Fripp
Payam        Kaufling
Shanta       Vollman
Kevin        Mourgos
Julia        Nayer
Irene        Mikkilineni
James        Landry
Steven       Markle
Laura        Bissot
Mozhe        Atkinson
James        Marlow
TJ           Olson
Jason        Mallin
Michael      Rogers
Ki           Gee
Hazel        Philtanker
Renske       Ladwig
Stephen      Stiles
John         Seo
Joshua       Patel
Trenna       Rajs
Curtis       Davies
Randall      Matos
Peter        Vargas
John         Russell
Karen        Partners
Alberto      Errazuriz
Gerald       Cambrault
Eleni        Zlotkey
Winston      Taylor
Jean         Fleaur
Martha       Sullivan
Girard       Geoni
Nandita      Sarchand
Alexis       Bull
Julia        Dellinger
Anthony      Cabrio
Kelly        Chung
Jennifer     Dilly
Timothy      Gates
Randall      Perkins
Sarah        Bell
Britney      Everett
Samuel       McCain
Vance        Jones
Alana        Walsh
Kevin        Feeney
Donald       OConnell
Douglas      Grant
Jennifer     Whalen
Michael      Hartstein
Susan        Mavris
Hermann      Baer
Shelley      Higgins
William      Gietz
-----------  -----------

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

In [131]:
cur.execute("SELECT first_name, last_name,manager_id from employees ;")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------  ---
Steven       King           0
Neena        Kochhar      100
Lex          De Haan      100
Alexander    Hunold       102
Bruce        Ernst        103
David        Austin       103
Valli        Pataballa    103
Diana        Lorentz      103
Nancy        Greenberg    101
Daniel       Faviet       108
John         Chen         108
Ismael       Sciarra      108
Jose Manuel  Urman        108
Luis         Popp         108
Den          Raphaely     100
Alexander    Khoo         114
Shelli       Baida        114
Sigal        Tobias       114
Guy          Himuro       114
Karen        Colmenares   114
Matthew      Weiss        100
Adam         Fripp        100
Payam        Kaufling     100
Shanta       Vollman      100
Kevin        Mourgos      100
Julia        Nayer        120
Irene        Mikkilineni  120
James        Landry       120
Steven       Markle       120
Laura        Bissot       121
Mozhe        Atkinson     121
James        Marlow       121
TJ           Olson        121
Jason        Mallin       122
Michael      Rogers       122
Ki           Gee          122
Hazel        Philtanker   122
Renske       Ladwig       123
Stephen      Stiles       123
John         Seo          123
Joshua       Patel        123
Trenna       Rajs         124
Curtis       Davies       124
Randall      Matos        124
Peter        Vargas       124
John         Russell      100
Karen        Partners     100
Alberto      Errazuriz    100
Gerald       Cambrault    100
Eleni        Zlotkey      100
Peter        Tucker       145
David        Bernstein    145
Peter        Hall         145
Christopher  Olsen        145
Nanette      Cambrault    145
Oliver       Tuvault      145
Janette      King         146
Patrick      Sully        146
Allan        McEwen       146
Lindsey      Smith        146
Louise       Doran        146
Sarath       Sewall       146
Clara        Vishney      147
Danielle     Greene       147
Mattea       Marvins      147
David        Lee          147
Sundar       Ande         147
Amit         Banda        147
Lisa         Ozer         148
Harrison     Bloom        148
Tayler       Fox          148
William      Smith        148
Elizabeth    Bates        148
Sundita      Kumar        148
Ellen        Abel         149
Alyssa       Hutton       149
Jonathon     Taylor       149
Jack         Livingston   149
Kimberely    Grant        149
Charles      Johnson      149
Winston      Taylor       120
Jean         Fleaur       120
Martha       Sullivan     120
Girard       Geoni        120
Nandita      Sarchand     121
Alexis       Bull         121
Julia        Dellinger    121
Anthony      Cabrio       121
Kelly        Chung        122
Jennifer     Dilly        122
Timothy      Gates        122
Randall      Perkins      122
Sarah        Bell         123
Britney      Everett      123
Samuel       McCain       123
Vance        Jones        123
Alana        Walsh        124
Kevin        Feeney       124
Donald       OConnell     124
Douglas      Grant        124
Jennifer     Whalen       101
Michael      Hartstein    100
Pat          Fay          201
Susan        Mavris       101
Hermann      Baer         101
Shelley      Higgins      101
William      Gietz        205
-----------  -----------  ---

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

In [133]:
cur.execute("SELECT first_name, last_name, salary FROM employees WHERE salary > (SELECT avg(salary) FROM employees);")
print(tabulate.tabulate(cur.fetchall()))

-----------  ----------  -----
Steven       King        24000
Neena        Kochhar     17000
Lex          De Haan     17000
Alexander    Hunold       9000
Nancy        Greenberg   12000
Daniel       Faviet       9000
John         Chen         8200
Ismael       Sciarra      7700
Jose Manuel  Urman        7800
Luis         Popp         6900
Den          Raphaely    11000
Matthew      Weiss        8000
Adam         Fripp        8200
Payam        Kaufling     7900
Shanta       Vollman      6500
John         Russell     14000
Karen        Partners    13500
Alberto      Errazuriz   12000
Gerald       Cambrault   11000
Eleni        Zlotkey     10500
Peter        Tucker      10000
David        Bernstein    9500
Peter        Hall         9000
Christopher  Olsen        8000
Nanette      Cambrault    7500
Oliver       Tuvault      7000
Janette      King        10000
Patrick      Sully        9500
Allan        McEwen       9000
Lindsey      Smith        8000
Louise       Doran        7500
Sarath       Sewall       7000
Clara        Vishney     10500
Danielle     Greene       9500
Mattea       Marvins      7200
David        Lee          6800
Lisa         Ozer        11500
Harrison     Bloom       10000
Tayler       Fox          9600
William      Smith        7400
Elizabeth    Bates        7300
Ellen        Abel        11000
Alyssa       Hutton       8800
Jonathon     Taylor       8600
Jack         Livingston   8400
Kimberely    Grant        7000
Michael      Hartstein   13000
Susan        Mavris       6500
Hermann      Baer        10000
Shelley      Higgins     12000
William      Gietz        8300
-----------  ----------  -----

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

In [145]:
cur.execute("SELECT first_name, last_name, salary FROM employees WHERE employees.salary = (SELECT min_salary FROM jobs WHERE employees.job_id = jobs.job_id);")
print(tabulate.tabulate(cur.fetchall()))

-------  ----------  ----
Karen    Colmenares  2500
Martha   Sullivan    2500
Randall  Perkins     2500
-------  ----------  ----

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

In [147]:
cur.execute("SELECT first_name, last_name, salary FROM employees WHERE department_id IN (SELECT department_id FROM departments WHERE depart_name LIKE 'IT%') AND salary > (SELECT avg(salary) FROM employees);")
print(tabulate.tabulate(cur.fetchall()))

---------  ------  ----
Alexander  Hunold  9000
---------  ------  ----

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

In [137]:
cur.execute("SELECT first_name, last_name FROM employees WHERE salary > (SELECT salary FROM employees where last_name == 'Bell');")
print(tabulate.tabulate(cur.fetchall()))

-----------  ----------
Steven       King
Neena        Kochhar
Lex          De Haan
Alexander    Hunold
Bruce        Ernst
David        Austin
Valli        Pataballa
Diana        Lorentz
Nancy        Greenberg
Daniel       Faviet
John         Chen
Ismael       Sciarra
Jose Manuel  Urman
Luis         Popp
Den          Raphaely
Matthew      Weiss
Adam         Fripp
Payam        Kaufling
Shanta       Vollman
Kevin        Mourgos
John         Russell
Karen        Partners
Alberto      Errazuriz
Gerald       Cambrault
Eleni        Zlotkey
Peter        Tucker
David        Bernstein
Peter        Hall
Christopher  Olsen
Nanette      Cambrault
Oliver       Tuvault
Janette      King
Patrick      Sully
Allan        McEwen
Lindsey      Smith
Louise       Doran
Sarath       Sewall
Clara        Vishney
Danielle     Greene
Mattea       Marvins
David        Lee
Sundar       Ande
Amit         Banda
Lisa         Ozer
Harrison     Bloom
Tayler       Fox
William      Smith
Elizabeth    Bates
Sundita      Kumar
Ellen        Abel
Alyssa       Hutton
Jonathon     Taylor
Jack         Livingston
Kimberely    Grant
Charles      Johnson
Nandita      Sarchand
Alexis       Bull
Jennifer     Whalen
Michael      Hartstein
Pat          Fay
Susan        Mavris
Hermann      Baer
Shelley      Higgins
William      Gietz
-----------  ----------

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

In [141]:
cur.execute("SELECT first_name, last_name FROM employees WHERE salary == (SELECT min(salary) FROM employees);")
print(tabulate.tabulate(cur.fetchall()))

--  -----
TJ  Olson
--  -----

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

In [144]:
cur.execute("SELECT b.first_name,b.last_name FROM employees b WHERE NOT EXISTS (SELECT 'X' FROM employees a WHERE a.manager_id = b.employee_id);")
print(tabulate.tabulate(cur.fetchall()))

-----------  -----------
Bruce        Ernst
David        Austin
Valli        Pataballa
Diana        Lorentz
Daniel       Faviet
John         Chen
Ismael       Sciarra
Jose Manuel  Urman
Luis         Popp
Alexander    Khoo
Shelli       Baida
Sigal        Tobias
Guy          Himuro
Karen        Colmenares
Julia        Nayer
Irene        Mikkilineni
James        Landry
Steven       Markle
Laura        Bissot
Mozhe        Atkinson
James        Marlow
TJ           Olson
Jason        Mallin
Michael      Rogers
Ki           Gee
Hazel        Philtanker
Renske       Ladwig
Stephen      Stiles
John         Seo
Joshua       Patel
Trenna       Rajs
Curtis       Davies
Randall      Matos
Peter        Vargas
Peter        Tucker
David        Bernstein
Peter        Hall
Christopher  Olsen
Nanette      Cambrault
Oliver       Tuvault
Janette      King
Patrick      Sully
Allan        McEwen
Lindsey      Smith
Louise       Doran
Sarath       Sewall
Clara        Vishney
Danielle     Greene
Mattea       Marvins
David        Lee
Sundar       Ande
Amit         Banda
Lisa         Ozer
Harrison     Bloom
Tayler       Fox
William      Smith
Elizabeth    Bates
Sundita      Kumar
Ellen        Abel
Alyssa       Hutton
Jonathon     Taylor
Jack         Livingston
Kimberely    Grant
Charles      Johnson
Winston      Taylor
Jean         Fleaur
Martha       Sullivan
Girard       Geoni
Nandita      Sarchand
Alexis       Bull
Julia        Dellinger
Anthony      Cabrio
Kelly        Chung
Jennifer     Dilly
Timothy      Gates
Randall      Perkins
Sarah        Bell
Britney      Everett
Samuel       McCain
Vance        Jones
Alana        Walsh
Kevin        Feeney
Donald       OConnell
Douglas      Grant
Jennifer     Whalen
Pat          Fay
Susan        Mavris
Hermann      Baer
William      Gietz
-----------  -----------

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

In [148]:
cur.execute("SELECT employee_id,first_name,last_name,salary FROM employees where salary > (select avg(salary) from employees group by department_id);")
print(tabulate.tabulate(cur.fetchall()))

---  -----------  ----------  -----
100  Steven       King        24000
101  Neena        Kochhar     17000
102  Lex          De Haan     17000
103  Alexander    Hunold       9000
108  Nancy        Greenberg   12000
109  Daniel       Faviet       9000
110  John         Chen         8200
111  Ismael       Sciarra      7700
112  Jose Manuel  Urman        7800
114  Den          Raphaely    11000
120  Matthew      Weiss        8000
121  Adam         Fripp        8200
122  Payam        Kaufling     7900
145  John         Russell     14000
146  Karen        Partners    13500
147  Alberto      Errazuriz   12000
148  Gerald       Cambrault   11000
149  Eleni        Zlotkey     10500
150  Peter        Tucker      10000
151  David        Bernstein    9500
152  Peter        Hall         9000
153  Christopher  Olsen        8000
154  Nanette      Cambrault    7500
156  Janette      King        10000
157  Patrick      Sully        9500
158  Allan        McEwen       9000
159  Lindsey      Smith        8000
160  Louise       Doran        7500
162  Clara        Vishney     10500
163  Danielle     Greene       9500
164  Mattea       Marvins      7200
168  Lisa         Ozer        11500
169  Harrison     Bloom       10000
170  Tayler       Fox          9600
171  William      Smith        7400
172  Elizabeth    Bates        7300
174  Ellen        Abel        11000
175  Alyssa       Hutton       8800
176  Jonathon     Taylor       8600
177  Jack         Livingston   8400
201  Michael      Hartstein   13000
204  Hermann      Baer        10000
205  Shelley      Higgins     12000
206  William      Gietz        8300
---  -----------  ----------  -----

+ Write a query to find the 5th maximum salary in the employees table.

In [152]:
#No entendi como fazer;
cur.execute("SELECT DISTINCT salary FROM employees e1 WHERE 5 = (SELECT COUNT(DISTINCT salary) FROM employees  e2 WHERE e2.salary >= e1.salary);")
print(tabulate.tabulate(cur.fetchall()))

-----
13000
-----

+ Write a query to find the 4th minimum salary in the employees table.

In [162]:
#No entendi como fazer;
cur.execute("SELECT DISTINCT salary FROM employees e1 WHERE 4 = (SELECT COUNT(DISTINCT salary) FROM employees  e2 WHERE e2.salary <= e1.salary);")
print(tabulate.tabulate(cur.fetchall()))

----
2500
----
----
2100
2200
2400
----

+ Write a query to select last 10 records from a table.

In [158]:
cur.execute("SELECT * FROM (SELECT * FROM employees ORDER BY employee_id DESC LIMIT 10) sub ORDER BY employee_id ASC;")
print(tabulate.tabulate(cur.fetchall()))

---  --------  ---------  --------  ------------  ----------  ----------  -----  -  ---  ---
197  Kevin     Feeney     KFEENEY   650.507.9822  1987-09-22  SH_CLERK     3000  0  124   50
198  Donald    OConnell   DOCONNEL  650.507.9833  1987-09-23  SH_CLERK     2600  0  124   50
199  Douglas   Grant      DGRANT    650.507.9844  1987-09-24  SH_CLERK     2600  0  124   50
200  Jennifer  Whalen     JWHALEN   515.123.4444  1987-09-25  AD_ASST      4400  0  101   10
201  Michael   Hartstein  MHARTSTE  515.123.5555  1987-09-26  MK_MAN      13000  0  100   20
202  Pat       Fay        PFAY      603.123.6666  1987-09-27  MK_REP       6000  0  201   20
203  Susan     Mavris     SMAVRIS   515.123.7777  1987-09-28  HR_REP       6500  0  101   40
204  Hermann   Baer       HBAER     515.123.8888  1987-09-29  PR_REP      10000  0  101   70
205  Shelley   Higgins    SHIGGINS  515.123.8080  1987-09-30  AC_MGR      12000  1  101  110
206  William   Gietz      WGIETZ    515.123.8181  1987-10-01  AC_ACCOUNT   8300  1  205  110
---  --------  ---------  --------  ------------  ----------  ----------  -----  -  ---  ---

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

In [163]:
cur.execute("SELECT * FROM departments WHERE department_id NOT IN (select department_id FROM employees);")
print(tabulate.tabulate(cur.fetchall()))

---  --------------------    ----
120  Treasury                1700
130  Corporate Tax           1700
140  Control And Credit      1700
150  Shareholder Services    1700
160  Benefits                1700
170  Manufacturing           1700
180  Construction            1700
190  Contracting             1700
200  Operations              1700
210  IT Support              1700
220  NOC                     1700
230  IT Helpdesk             1700
240  Government Sales        1700
250  Retail Sales            1700
260  Recruiting              1700
270  Payroll                 1700
---  --------------------    ----

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

In [166]:
cur.execute("SELECT location_id, street_address, city, state_province, country_name FROM locations NATURAL JOIN countries;")
print(tabulate.tabulate(cur.fetchall()))

----  ----------------------------------------  -------------------  -----------------  ------------------------
1000  1297 Via Cola di Rie                      Roma                                    Italy
1100  93091 Calle della Testa                   Venice                                  Italy
1200  2017 Shinjuku-ku                          Tokyo                Tokyo Prefecture   Japan
1300  9450 Kamiya-cho                           Hiroshima                               Japan
1400  2014 Jabberwocky Rd                       Southlake            Texas              United States of America
1500  2011 Interiors Blvd                       South San Francisco  California         United States of America
1600  2007 Zagora St                            South Brunswick      New Jersey         United States of America
1700  2004 Charade Rd                           Seattle              Washington         United States of America
1800  147 Spadina Ave                           Toronto              Ontario            Canada
1900  6092 Boxwood St                           Whitehorse           Yukon              Canada
2000  40-5-12 Laogianggen                       Beijing                                 China
2100  1298 Vileparle (E)                        Bombay               Maharashtra        India
2200  12-98 Victoria Street                     Sydney               New South Wales    Australia
2300  198 Clementi North                        Singapore                               Singapore
2400  8204 Arthur St                            London                                  United Kingdom
2500  Magdalen Centre, The Oxford Science Park  Oxford               Oxford             United Kingdom
2600  9702 Chester Road                         Stretford            Manchester         United Kingdom
2700  Schwanthalerstr. 7031                     Munich               Bavaria            Germany
2800  Rua Frei Caneca 1360                      Sao Paulo            Sao Paulo          Brazil
2900  20 Rue des Corps-Saints                   Geneva               Geneve             Switzerland
3000  Murtenstrasse 921                         Bern                 BE                 Switzerland
3100  Pieter Breughelstraat 837                 Utrecht              Utrecht            Netherlands
3200  Mariano Escobedo 9991                     Mexico City          Distrito Federal,  Mexico
----  ----------------------------------------  -------------------  -----------------  ------------------------

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

+ Write a query to get the department name and number of employees in the department.

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

+ Write a query to display the department ID, department name, and manager first name.

+ Write a query to display the department name, manager name, and city.

+ Write a query to display the job title and average salary of employees.

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.